In [5]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aa','bb',np.nan,'ccc'])
print(string_data)

0     aa
1     bb
2    NaN
3    ccc
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None
string_data

0    None
1      bb
2     NaN
3     ccc
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

### 滤除空数据

In [11]:
from  numpy import nan as NA
data = pd.Series([1,NA,2,NA,3])
data.dropna()

0    1.0
2    2.0
4    3.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    2.0
4    3.0
dtype: float64

In [14]:
data = pd.DataFrame([[1,3,5],[2,NA,NA],[NA,NA,NA],[NA,2,4]])
data

     0    1    2
0  1.0  3.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  2.0  4.0

In [15]:
clean = data.dropna()   ### 默认丢弃任何含有空值的行
clean

     0    1    2
0  1.0  3.0  5.0

In [16]:
data.dropna(how='all')  #  how  参数设置为all 则丢弃全为空值的行

     0    1    2
0  1.0  3.0  5.0
1  2.0  NaN  NaN
3  NaN  2.0  4.0

In [19]:
data[4] = NA
data

     0    1    2   4
0  1.0  3.0  5.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  2.0  4.0 NaN

In [27]:
a = data.dropna(axis=1,how = 'all')
a

     0    1    2
0  1.0  3.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  2.0  4.0

In [28]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.134012  0.745851  0.967411
1  0.994224 -0.302504 -1.052500
2 -0.220199  0.130622  0.344546
3  0.475502 -0.871225 -0.485569
4 -0.662658  1.211552  0.038452
5  0.206590 -0.639328  0.121493
6 -0.050971  0.539034  0.431162

In [29]:
df.iloc[:4,1] = NA
df

          0         1         2
0  0.134012       NaN  0.967411
1  0.994224       NaN -1.052500
2 -0.220199       NaN  0.344546
3  0.475502       NaN -0.485569
4 -0.662658  1.211552  0.038452
5  0.206590 -0.639328  0.121493
6 -0.050971  0.539034  0.431162

In [37]:
df.iloc[3:,2] = NA
df

          0         1         2
0  0.134012       NaN  0.967411
1  0.994224       NaN -1.052500
2 -0.220199       NaN  0.344546
3  0.475502       NaN       NaN
4 -0.662658  1.211552       NaN
5  0.206590 -0.639328       NaN
6 -0.050971  0.539034       NaN

In [38]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [46]:

df
b = df.dropna(thresh=2)
b

          0         1         2
0  0.134012       NaN  0.967411
1  0.994224       NaN -1.052500
2 -0.220199       NaN  0.344546
4 -0.662658  1.211552       NaN
5  0.206590 -0.639328       NaN
6 -0.050971  0.539034       NaN

### 填充缺失数据

In [47]:
df.fillna(0)

          0         1         2
0  0.134012  0.000000  0.967411
1  0.994224  0.000000 -1.052500
2 -0.220199  0.000000  0.344546
3  0.475502  0.000000  0.000000
4 -0.662658  1.211552  0.000000
5  0.206590 -0.639328  0.000000
6 -0.050971  0.539034  0.000000

In [49]:
### 通过字典典用filllna  实现不同列填充不同的值
df.fillna({1:0.5,2:1})

          0         1         2
0  0.134012  0.500000  0.967411
1  0.994224  0.500000 -1.052500
2 -0.220199  0.500000  0.344546
3  0.475502  0.500000  1.000000
4 -0.662658  1.211552  1.000000
5  0.206590 -0.639328  1.000000
6 -0.050971  0.539034  1.000000

In [53]:
df.fillna(0,inplace=True)
# df.fillna(0)

          0         1         2
0  0.134012  0.000000  0.967411
1  0.994224  0.000000 -1.052500
2 -0.220199  0.000000  0.344546
3  0.475502  0.000000  0.000000
4 -0.662658  1.211552  0.000000
5  0.206590 -0.639328  0.000000
6 -0.050971  0.539034  0.000000

In [55]:
df.iloc[2:,1]  = NA
df.iloc[4:,2] = NA
df

          0    1         2
0  0.134012  0.0  0.967411
1  0.994224  0.0 -1.052500
2 -0.220199  NaN  0.344546
3  0.475502  NaN  0.000000
4 -0.662658  NaN       NaN
5  0.206590  NaN       NaN
6 -0.050971  NaN       NaN

In [62]:

df.fillna(method='ffill')
df

          0    1         2
0  0.134012  0.0  0.967411
1  0.994224  0.0 -1.052500
2 -0.220199  NaN  0.344546
3  0.475502  NaN  0.000000
4 -0.662658  NaN       NaN
5  0.206590  NaN       NaN
6 -0.050971  NaN       NaN

In [57]:
data = pd.Series([1,3,54,NA])
data.fillna(data.mean())

0     1.000000
1     3.000000
2    54.000000
3    19.333333
dtype: float64

###  数据转换

In [6]:
import pandas as pd
data = pd.DataFrame({'k1':['one','two'] *3 + ['two'],'k2':[1,2,1,1,2,3,4]})
data

    k1  k2
0  one   1
1  two   2
2  one   1
3  two   1
4  one   2
5  two   3
6  two   4

In [7]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [8]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   2
3  two   1
4  one   2
5  two   3
6  two   4

In [9]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   2   1
2  one   1   2
3  two   1   3
4  one   2   4
5  two   3   5
6  two   4   6

In [11]:
b = data.drop_duplicates(['k1'])
b

    k1  k2  v1
0  one   1   0
1  two   2   1

In [12]:
b = data.drop_duplicates(['k1'],keep='last')
b

    k1  k2  v1
4  one   2   4
6  two   4   6

###  利用函数映射进行转换

In [14]:
data = pd.DataFrame({'food':['a','b','c','d'],'price':[1,3,5,6]})
data

  food  price
0    a      1
1    b      3
2    c      5
3    d      6